### pandas 基本操作

In [2]:
# 1 导入数据库
import pandas as pd
pd.__version__

'1.1.2'

In [3]:
# 2 创建Series
arr = [1,2,3,4,5]
df = pd.Series(arr) #如果不指定索引，则默认从 0 开始
df

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
# 3 从字典创建Series  不是df
d = {'a':1,'b':2,'c':3,'d':4,'e':5}
df = pd.Series(d)
df

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
# 从Numpy 数组创建DataFrame
import numpy as np

dates = pd.date_range('today',periods=6) # 定义时间序列作为 index
num_arr = np.random.randn(6,4) # 传入 numpy 随机数组
num_arr
columns = ['A','B','C','D'] # 将列表作为列名
df = pd.DataFrame(num_arr, index = dates, columns = columns)
df

                                   A         B         C         D
2021-05-10 11:57:12.049917  0.328890 -1.296606  0.457852 -0.206067
2021-05-11 11:57:12.049917  0.382790 -2.658462 -0.252191  0.327936
2021-05-12 11:57:12.049917  0.242154 -0.376465 -1.063689 -0.046679
2021-05-13 11:57:12.049917 -1.172072 -1.773916  1.526543  0.404445
2021-05-14 11:57:12.049917 -1.681175  0.474526  0.248240 -0.905616
2021-05-15 11:57:12.049917  0.868060 -0.403812  1.039277 -0.017372

In [6]:
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df.info

<bound method DataFrame.info of   animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no>

In [7]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [8]:
# 取出其中两列 
df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [9]:
### 取出索引为【3，4，8】行的animal和age列
df.loc[df.index[[3,4,8]],['animal','age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [10]:
# 取出age大于3的行
df[df['age']>3]

  animal  age  visits priority
e    dog  5.0       2       no
g  snake  4.5       1       no
i    dog  7.0       2       no

In [11]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [12]:
# 13.取出age在2,4间的行（不含）
df[(df['age']>2) & (df['age']<4)]

# 方法二  between函数的使用
df[df['age'].between(2, 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [13]:
# 14. `f行的age改为1.5
df.loc['f','age'] = 1.6
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.6       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [14]:
# 15. 计算visits的总和
df['visits'].sum()

19

In [15]:
df.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

In [17]:
# 16. 计算每个不同种类animal的age的平均数
a = df.groupby('animal')['age'].mean()
a = pd.DataFrame(a)
a

             age
animal
cat     2.366667
dog     5.000000
snake   2.500000

In [18]:
# 17. 计算df中每个种类animal的数量
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

In [19]:
# 18. 先按age降序排列，后按visits升序排列
df.sort_values(by=['age','visits'],ascending=[False,True])

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  1.6       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

In [20]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [21]:
# 19. 将priority列中的yes, no替换为布尔值True, False map函数的使用
df['priority'] = df['priority'].map({'no':False,'yes':True})
df

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  2.0       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

In [82]:
# 20. 将animal列中的snake替换为python
df['animal'] = df['animal'].replace('snake','python')
df

   animal  age  visits  priority
a     cat  2.5       1      True
b     cat  3.0       3      True
c  python  0.5       2     False
d     dog  NaN       3      True
e     dog  5.0       2     False
f     cat  2.0       3     False
g  python  4.5       1     False
h     cat  NaN       1      True
i     dog  7.0       2     False
j     dog  3.0       1     False

In [23]:
# 21. 对每种animal的每种不同数量visits，计算平均age，即，返回一个表格，
# 行是aniaml种类，列是visits数量，表格值是行动物种类列访客数量的平均年龄

df = df.fillna(0)
df1 = pd.pivot_table(data=df,index='animal',columns='visits',values='age',aggfunc=np.sum)
df1

visits    1     2    3
animal
cat     2.5   NaN  5.0
dog     3.0  12.0  0.0
snake   4.5   0.5  NaN

In [24]:
# 22. 在df中插入新行k，然后删除该行
df.loc['k'] = [5.5,'dog','no',2]
df = df.drop('k')
df

  animal  age visits  priority
a    cat  2.5      1         1
b    cat    3      3         1
c  snake  0.5      2         0
d    dog    0      3         1
e    dog    5      2         0
f    cat    2      3         0
g  snake  4.5      1         0
h    cat    0      1         1
i    dog    7      2         0
j    dog    3      1         0

In [25]:
# 22 透视表的使用   这个很方便需要记住
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [96]:
# 23. 有一列整数列A的DatraFrame，删除数值重复的行
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df
# df1 =df.drop_duplicates(subset='A')
df1 = df.loc[df['A'].shift() != df['A']]
df1
df['A'].shift()

0     NaN
1     1.0
2     2.0
3     2.0
4     3.0
5     4.0
6     5.0
7     5.0
8     5.0
9     6.0
10    7.0
Name: A, dtype: float64

In [27]:
import pandas as pd
import numpy as np
# 24. 一个全数值DatraFrame，每个数字减去该行的平均数  sub用法

df = pd.DataFrame(np.random.randint(low=1,high=10,size=(5, 3)))
print(df)
print(df.mean(axis=0))  # axis=0 为按照列求均值
print(df.mean(axis=1))  # axis=1 为按照行求均值
df1 = df.sub(df.mean(axis=1),axis=0)  # 
df1

# importing pandas as pd 
import pandas as pd 
# Creating the dataframe  
df_2 = pd.DataFrame({"A":[1, 5, 3, 4, 2], 
                   "B":[3, 2, 4, 3, 4],  
                   "C":[2, 2, 7, 3, 4],  
                   "D":[4, 3, 6, 12, 7]},  
                   index =["A1", "A2", "A3", "A4", "A5"]) 


print('df_2',df_2)
sr = pd.Series([12, 25, 64, 18], index =["A", "B", "C", "D"])
df_sub = df_2.sub(sr, axis = 1)    
df_sub

   0  1  2
0  2  3  1
1  5  8  9
2  6  8  7
3  1  4  2
4  3  9  5
0    3.4
1    6.4
2    4.8
dtype: float64
0    2.000000
1    7.333333
2    7.000000
3    2.333333
4    5.666667
dtype: float64
df_2     A  B  C   D
A1  1  3  2   4
A2  5  2  2   3
A3  3  4  7   6
A4  4  3  3  12
A5  2  4  4   7

     A   B   C   D
A1 -11 -22 -62 -14
A2  -7 -23 -62 -15
A3  -9 -21 -57 -12
A4  -8 -22 -61  -6
A5 -10 -21 -60 -11

In [18]:
# 25. 一个有5列的DataFrame，求哪一列的和最小
import pandas as pd
import numpy as np
df1 = pd.DataFrame(np.random.randint(low=0,high=10,size=(5,4)),columns=list('abcd'))
df1['index'] = list('一二三四五')
df1 = df1.set_index('index',drop=True)
df1
df1.sum(axis=0).idxmin()  # 找出一列和最小
df1.sum(axis=1).idxmin()  # 找出哪一行和最小

'三'

In [63]:
# 26. 给定DataFrame，求代号列不同分组数据中  ‘数值’数值最大的三个值的和 
df = pd.DataFrame({'代号': list('aaabbcaabcccbbc'), 
                   '数值': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

# 方法1
df1 = df.groupby('代号')['数值'].nlargest(3).sum(level=0)   # 主要是groupby的用法
print('方法1',df1)

# 方法2
def nlargest_sum(data,n):
    data = data.sort_values(ascending=False)
    return data[:n].sum()

df_nlagest = df.groupby('代号')['数值'].apply(lambda x : nlargest_sum(x,n=3))
print('方法2',df_nlagest)

方法1 代号
a    409
b    156
c    345
Name: 数值, dtype: int64
方法2 代号
a    409
b    156
c    345
Name: 数值, dtype: int64

In [64]:
# 27. 给定DataFrame，有列A, B，A的值在1-100（含），对A列数值 10步长，求对应的B的值和
# 练习 pd.cut()函数
df = pd.DataFrame({'A': [1,2,11,11,33,34,35,40,79,99], 
                   'B': [1,2,11,11,33,34,35,40,79,99]})
cut_data = pd.cut(df['A'],bins=np.arange(0,101,10))
bins = np.arange(0,101,10)          # np用法
df.groupby(cut_data)['B'].sum()     # 这个用法并不熟悉

A
(0, 10]        3
(10, 20]      22
(20, 30]       0
(30, 40]     142
(40, 50]       0
(50, 60]       0
(60, 70]       0
(70, 80]      79
(80, 90]       0
(90, 100]     99
Name: B, dtype: int64

In [78]:
# np.r_ 按照行   np.c_是按照列进行矩阵的拼接
import numpy as np
x = np.arange(9).reshape(3, 3)
y = np.ones([3, 3])
c = np.r_[x, y]
d = np.c_[x, y]

array([[0., 1., 2., 1., 1., 1.],
       [3., 4., 5., 1., 1., 1.],
       [6., 7., 8., 1., 1., 1.]])

In [5]:
import numpy as np
import pandas as pd
# 28. 给定DataFrame，计算每个元素至左边最近的0 如果左边没有0那就是到开头的距离的距离，生成新列y 
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

# 方法1    左边 0 的位置，然后所有的数据的位置
# first_zero_index = df.loc[df['X']==0].index[0]
# index_all = np.arange(0,df.shape[0],1)
# df['Y'] = abs(index_all - first_zero_index)
#  方法二
x = (df['X'] != 0).cumsum()
y = x != x.shift()
df['Y'] = y.groupby((y != y.shift()).cumsum()).cumsum()
df

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2